c1_sdd_linux-ipcs/cursor_tmp/flow_umls/linux_6_3_9_ipcsOsPollChannels.puml
@startuml
!pragma layout smetana
skinparam conditionStyle insideDiamond
skinparam linetype ortho
start
if (irq_num == IPC_IRQ_NONE?) then (yes)
  if (rx_cb != NULL?) then (yes)
    :return rx_cb(instance, IPC_SOFTIRQ_BUDGET);;
  else (no)
    :return -EINVAL;
  endif
else (no)
  :return -EOPNOTSUPP;
endif
stop
@enduml
